qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_rcc.h
#define IS_RCC_PLLSOURCE(INSTANCE)                 (((INSTANCE) == RCC_PLLSOURCE_HSEOSC)         ||\
                                                   ((INSTANCE) == RCC_PLLSOURCE_HSECLK)         ||\
                                                   ((INSTANCE) == RCC_PLLSOURCE_HSI))

#define RCC_PLL_WAITCYCLE_128                      (0x00000000U)
#define RCC_PLL_WAITCYCLE_256                      ((uint32_t)(0x1UL << SYSCTRL_PLL_WAITCYCLE_Pos))
#define RCC_PLL_WAITCYCLE_512                      ((uint32_t)(0x2UL << SYSCTRL_PLL_WAITCYCLE_Pos))
#define RCC_PLL_WAITCYCLE_1024                     ((uint32_t)(0x3UL << SYSCTRL_PLL_WAITCYCLE_Pos))
#define RCC_PLL_WAITCYCLE_2048                     ((uint32_t)(0x4UL << SYSCTRL_PLL_WAITCYCLE_Pos))
#define RCC_PLL_WAITCYCLE_4096                     ((uint32_t)(0x5UL << SYSCTRL_PLL_WAITCYCLE_Pos))
#define RCC_PLL_WAITCYCLE_8192                     ((uint32_t)(0x6UL << SYSCTRL_PLL_WAITCYCLE_Pos))
#define RCC_PLL_WAITCYCLE_16384                    ((uint32_t)(0x7UL << SYSCTRL_PLL_WAITCYCLE_Pos))

#define RCC_PLL_FREQOUT_GT12M                      (0x00000000U)
#define RCC_PLL_FREQOUT_GT18M                      ((uint32_t)(0x1UL << SYSCTRL_PLL_FREQOUT_Pos))
#define RCC_PLL_FREQOUT_GT24M                      ((uint32_t)(0x2UL << SYSCTRL_PLL_FREQOUT_Pos))
#define RCC_PLL_FREQOUT_GT36M                      ((uint32_t)(0x3UL << SYSCTRL_PLL_FREQOUT_Pos))
#define RCC_PLL_FREQOUT_GT48M                      ((uint32_t)(0x4UL << SYSCTRL_PLL_FREQOUT_Pos))
#define IS_RCC_PLL_FREQIN(INSTANCE)                (INSTANCE >=4000000)  && (INSTANCE <=24000000)


#define RCC_PLL_MUL_2                              (0x2U)
#define RCC_PLL_MUL_3                              (0x3U)
#define RCC_PLL_MUL_4                              (0x4U)
#define RCC_PLL_MUL_5                              (0x5U)
#define RCC_PLL_MUL_6                              (0x6U)
#define RCC_PLL_MUL_7                              (0x7U)
#define RCC_PLL_MUL_8                              (0x8U)
#define RCC_PLL_MUL_9                              (0x9U)
#define RCC_PLL_MUL_10                             (0xAU)
#define RCC_PLL_MUL_11                             (0xBU)
#define RCC_PLL_MUL_12                             (0xCU)
#define IS_RCC_PLL_MUL(INSTANCE)                   (((INSTANCE) == RCC_PLL_MUL_2)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_3)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_4)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_5)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_6)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_7)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_8)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_9)          ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_10)         ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_11)         ||\
                                                   ((INSTANCE) == RCC_PLL_MUL_12))

#define RCC_IT_HSEFAULT                            (bv8)
#define RCC_IT_LSEFAULT                            (bv7)
#define RCC_IT_HSEFAIL                             (bv6)
#define RCC_IT_LSEFAIL                             (bv5)
#define RCC_IT_LSERDY                              (bv4)
#define RCC_IT_LSIRDY                              (bv3)
#define RCC_IT_PLLRDY                              (bv2)
#define RCC_IT_HSERDY                              (bv1)
#define RCC_IT_HSIRDY                              (bv0)
#define IS_RCC_IT(IT)                              (((IT) & 0xFFFFFFE0 == 0x0UL) && ((IT) != 0x0UL))
#define IS_RCC_GET_IT(IT)                          (((IT) == RCC_IT_HSEFAULT) || \
                                                   ((IT) == RCC_IT_LSEFAULT) || \
                                                   ((IT) == RCC_IT_HSEFAIL) || \
                                                   ((IT) == RCC_IT_LSEFAIL) ||\
                                                   ((IT) == RCC_IT_LSERDY) ||\
                                                   ((IT) == RCC_IT_LSIRDY) ||\
                                                   ((IT) == RCC_IT_PLLRDY) ||\
                                                   ((IT) == RCC_IT_HSERDY) ||\
                                                   ((IT) == RCC_IT_HSIRDY))

#define RCC_FLAG_HSISTABLE                         bv11
#define RCC_FLAG_HSESTABLE                         bv12
#define RCC_FLAG_PLLSTABLE                         bv13
#define RCC_FLAG_LSISTABLE                         bv14
#define RCC_FLAG_LSESTABLE                         bv15
#define IS_RCC_STABLEFLAG(FLAG)                    (((FLAG) == RCC_FLAG_HSISTABLE) || ((FLAG) == RCC_FLAG_HSESTABLE) ||   \
                                                   ((FLAG) == RCC_FLAG_PLLSTABLE) || ((FLAG) == RCC_FLAG_LSESTABLE) ||   \
                                                   ((FLAG) == RCC_FLAG_LSISTABLE))




#define RCC_FLAG_PORRST                            bv0
#define RCC_FLAG_LVDRST                            bv3
#define RCC_FLAG_IWDTRST                           bv4
#define RCC_FLAG_WWDTRST                           bv5
#define RCC_FLAG_PINRST                            bv6
#define RCC_FLAG_LOCKUPRST                         bv8
#define RCC_FLAG_SYSRESETREQRST                    bv9
#define RCC_FLAG_ALLRST                            ((uint32_t)0x00000379)
#define IS_RCC_RSTFLAG(FLAG)                       (((FLAG) == RCC_FLAG_PINRST) || ((FLAG) == RCC_FLAG_PORRST) || \
                                                   ((FLAG) == RCC_FLAG_LVDRST) || ((FLAG) == RCC_FLAG_IWDTRST) || \
                                                   ((FLAG) == RCC_FLAG_WWDTRST) || ((FLAG) == RCC_FLAG_LOCKUPRST) || \
                                                   ((FLAG) == RCC_FLAG_SYSRESETREQRST) || ((FLAG) == RCC_FLAG_ALLRST))

