qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_rcc.h
#define RCC_AHB_PERIPH_AES                         bv11
#define RCC_AHB_PERIPH_TRNG                        bv10
#define RCC_AHB_PERIPH_GPIOF                       bv9
#define RCC_AHB_PERIPH_GPIOE                       bv8
#define RCC_AHB_PERIPH_GPIOD                       bv7
#define RCC_AHB_PERIPH_GPIOC                       bv6
#define RCC_AHB_PERIPH_GPIOB                       bv5
#define RCC_AHB_PERIPH_GPIOA                       bv4
#define RCC_AHB_PERIPH_CRC                         bv2
#define RCC_AHB_PERIPH_FLASH                       bv1
#define RCC_AHB_PERIPH_DMA                         bv0
#define IS_RCC_AHB_PERIPH(PERIPH)                  ((((PERIPH) & 0xFFFFF008 ) == 0x00) && ((PERIPH) != 0x00))

#define __RCC_AES_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_AES)
#define __RCC_TRNG_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_TRNG)
#define __RCC_GPIOF_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOF)
#define __RCC_GPIOE_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOE)
#define __RCC_GPIOD_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOD)
#define __RCC_GPIOC_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOC)
#define __RCC_GPIOB_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOB)
#define __RCC_GPIOA_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOA)
#define __RCC_CRC_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_CRC)
#define __RCC_FLASH_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_FLASH)
#define __RCC_DMA_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_DMA)

#define __RCC_AES_CLK_DISABLE()                    (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_AES))
#define __RCC_TRNG_CLK_DISABLE()                   (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_TRNG))
#define __RCC_GPIOF_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOF))
#define __RCC_GPIOE_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOE))
#define __RCC_GPIOD_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOD))
#define __RCC_GPIOC_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOC))
#define __RCC_GPIOB_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOB))
#define __RCC_GPIOA_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOA))
#define __RCC_CRC_CLK_DISABLE()                    (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_CRC))
#define __RCC_FLASH_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_FLASH))
#define __RCC_DMA_CLK_DISABLE()                    (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_DMA))

#define RCC_APB1_PERIPH_LPTIM                      bv15
#define RCC_APB1_PERIPH_LCD                        bv13
#define RCC_APB1_PERIPH_I2C2                       bv12
#define RCC_APB1_PERIPH_I2C1                       bv11
#define RCC_APB1_PERIPH_UART5                      bv10
#define RCC_APB1_PERIPH_UART4                      bv9
#define RCC_APB1_PERIPH_UART3                      bv8
#define RCC_APB1_PERIPH_UART2                      bv7
#define RCC_APB1_PERIPH_SPI2                       bv6
#define RCC_APB1_PERIPH_IWDT                       bv5
#define RCC_APB1_PERIPH_WWDT                       bv4
#define RCC_APB1_PERIPH_RTC                        bv3
#define RCC_APB1_PERIPH_GTIM2                      bv2
#define RCC_APB1_PERIPH_GTIM1                      bv1
#define IS_RCC_APB1_PERIPH(PERIPH)                 ((((PERIPH) & 0xFFFF4601 ) == 0x00) && ((PERIPH) != 0x00))

#define __RCC_LPTIM_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_LPTIM)
#define __RCC_LCD_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_LCD)
#define __RCC_I2C2_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_I2C2)
#define __RCC_I2C1_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_I2C1)
#define __RCC_UART5_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_UART5)
#define __RCC_UART4_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_UART4)
#define __RCC_UART3_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_UART3)
#define __RCC_UART2_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_UART2)
#define __RCC_SPI2_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_SPI2)
#define __RCC_IWDT_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_IWDT)
#define __RCC_WWDT_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_WWDT)
#define __RCC_RTC_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_RTC)
#define __RCC_GTIM2_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_GTIM2)
#define __RCC_GTIM1_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_GTIM1)

#define __RCC_LPTIM_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_LPTIM))
#define __RCC_LCD_CLK_DISABLE()                    (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_LCD))
#define __RCC_I2C2_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_I2C2))
#define __RCC_I2C1_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_I2C1))
#define __RCC_UART5_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART5))
#define __RCC_UART4_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART4))
#define __RCC_UART3_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART3))
#define __RCC_UART2_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART2))
#define __RCC_SPI2_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_SPI2))
#define __RCC_IWDT_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_IWDT))
#define __RCC_WWDT_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_WWDT))
#define __RCC_RTC_CLK_DISABLE()                    (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_RTC))
#define __RCC_GTIM2_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_GTIM2))
#define __RCC_GTIM1_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_GTIM1))

#define RCC_APB2_PERIPH_AUTOTRIM                   bv13
#define RCC_APB2_PERIPH_BTIM                       bv12
#define RCC_APB2_PERIPH_GTIM4                      bv11
#define RCC_APB2_PERIPH_GTIM3                      bv10
#define RCC_APB2_PERIPH_UART1                      bv9
#define RCC_APB2_PERIPH_SPI1                       bv8
#define RCC_APB2_PERIPH_ATIM                       bv7
#define RCC_APB2_PERIPH_VC                         bv4
#define RCC_APB2_PERIPH_ADC                        bv2
#define RCC_APB2_PERIPH_UART6                      bv1

#define IS_RCC_APB2_PERIPH(PERIPH)                 ((((PERIPH) & 0xFFFFC069 ) == 0x00) && ((PERIPH) != 0x00))

